src/Documents/инкОтпускРасчетПоСреднему/инкОтпускРасчетПоСреднему.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>инкОтпускРасчетПоСреднему</name>
  <basedOn>Document.инкПриказНаОтпуск</basedOn>
  <basedOn>Document.инкПриказВКомандировку</basedOn>
  <registerRecords>InformationRegister.инкРеестрОтпусков</registerRecords>
  <attributes>
    <name>ВидНачисления</name>
    <type>
      <types>ChartOfCalculationTypesRef.инкНачисления</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>EnumRef.инкВидРасчетаОтпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчетаДниЧасы</name>
    <type>
      <types>EnumRef.инкВидРасчетаДниЧасы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключитьГодовуюПремиюЗаПредыдущийГод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.инкОтпускРасчетПоСреднему</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомпенсацияЗаНеиспользованныйОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПояснениеРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочихДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.инкДолжности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасчетныеДанные</name>
    <attributes>
      <name>Год</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДниЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДниЧасыФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КорректировкаДни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КорректировкаДниРасчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремииМесяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремииКвартал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремииГод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Зарплата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПовышениеЗПКоэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПовышениеЗПСуммаИндексации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатРасчета</name>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.инкНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/инкРеестрОтпусков/инкРеестрОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкРеестрОтпусков</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОтпускДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтпускДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Отпуск</name>
    <type>
      <types>DocumentRef.инкОтпускРасчетПоСреднему</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/инкВидРасчетаОтпуска/инкВидРасчетаОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкВидРасчетаОтпуска</name>
  <enumValues>
    <name>Отпуск</name>
  </enumValues>
  <enumValues>
    <name>ПоСреднему</name>
  </enumValues>
</mdclass:Enum>

src/Enums/инкВидРасчетаДниЧасы/инкВидРасчетаДниЧасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкВидРасчетаДниЧасы</name>
  <enumValues>
    <name>ВДнях</name>
  </enumValues>
  <enumValues>
    <name>ВЧасах</name>
  </enumValues>
</mdclass:Enum>

src/Documents/инкОтпускРасчетПоСреднему/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ЗаписьДвижений_инкРеестрОтпусков();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьДокументНаОснованииДанных(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.ДокументОснование = ОбъектКопирования.Ссылка;
	
КонецПроцедуры

#Область о //Запись движений:

Процедура ЗаписьДвижений_инкРеестрОтпусков()
	
	Движения.инкРеестрОтпусков.Записывать = Истина;
	
	Движение = Движения.инкРеестрОтпусков.Добавить();
	ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
	Движение.Отпуск = ЭтотОбъект.Ссылка;
	Движение.ОтпускДатаНачала		= ЭтотОбъект.ПериодС;
	Движение.ОтпускДатаОкончания    = ЭтотОбъект.ПериодПО;
	Движение.КоличествоДней			= ЭтотОбъект.ОсновнойОтпускДни + ЭтотОбъект.ДополнительныйОтпускДни; 
	Движение.Сумма					= ЭтотОбъект.СуммаДокумента;		
	
КонецПроцедуры

#КонецОбласти	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДокументНаОснованииДанных(ДанныеЗаполнения) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;	
	КонецЕсли;
	
	Организация 	= ДанныеЗаполнения.Организация;
	Подразделение 	= ДанныеЗаполнения.Подразделение;
	Сотрудник 		= ДанныеЗаполнения.Сотрудник;
	
	Если инкОбщийКлиентСервер.ЕстьСвойство(ДанныеЗаполнения,"МесяцНачисления") Тогда
		МесяцНачисления = ДанныеЗаполнения.МесяцНачисления;
	ИначеЕсли инкОбщийКлиентСервер.ЕстьСвойство(ДанныеЗаполнения,"ДатаПриказа") Тогда
		МесяцНачисления = ДанныеЗаполнения.ДатаПриказа;	
	КонецЕсли;

	Если инкОбщийКлиентСервер.ЕстьСвойство(ДанныеЗаполнения,"ПериодС") Тогда
    	ПериодС 		= ДанныеЗаполнения.ПериодС;
	КонецЕсли;
	Если инкОбщийКлиентСервер.ЕстьСвойство(ДанныеЗаполнения,"ПериодПО") Тогда
    	ПериодПО 		= ДанныеЗаполнения.ПериодПО;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.инкПриказНаОтпуск") Тогда
		
		ВидРасчета = Перечисления.инкВидРасчетаОтпуска.Отпуск;
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ПериодПОДопОтпуск) Тогда
			ПериодПО = ДанныеЗаполнения.ПериодПОДопОтпуск;	
		КонецЕсли;             
		
		ОсновнойОтпускДни = ДанныеЗаполнения.КоличествоДнейОтпуска;
		ДополнительныйОтпускДни = ДанныеЗаполнения.КоличествоДнейДополнительногоОтпуска;	
		ДокументОснование = ДанныеЗаполнения;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.инкПриказВКомандировку") Тогда

		ВидРасчета = Перечисления.инкВидРасчетаОтпуска.ПоСреднему;
		ДокументОснование = ДанныеЗаполнения;
		
	КонецЕсли;  
	
	ВидРасчетаДниЧасы = Перечисления.инкВидРасчетаДниЧасы.ВДнях;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
